package classwork;

import java.util.Scanner;

/*Пользователь вводит натуральное число (целое, положительное).
Выясните, сколько цифр в числе.*/
// 356712 - это ввел пользователь, программа должна выдать: 6 цифр
// 1234567890987654321 - 19 цифр
public class DigitsInNumber {

    // Алгоритм
    // числа записываются в 10-тичной системе счисления, каждый знак отвечает за разряд числа
    // будем на каждом шагу делить число на 10 с остатком.


    // Взаимодействие с пользователем
    // запросить у него число
    // напечатать число равному количеству цифр

    Scanner scanner = new Scanner(System.in);

}
